In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("../datasets/Book1.csv")

In [3]:
df.head()

   Unnamed: 0  Years of Experience   Salary
0         NaN                  1.1  39343.0
1         NaN                  1.3  46205.0
2         NaN                  1.5  37731.0
3         NaN                  2.0  43525.0
4         NaN                  2.2  39891.0

In [4]:
df.tail()

    Unnamed: 0  Years of Experience    Salary
25         NaN                  9.0  105582.0
26         NaN                  9.5  116969.0
27         NaN                  9.6  112635.0
28         NaN                 10.3  122391.0
29         NaN                 10.5  121872.0

In [5]:
df.describe()

       Unnamed: 0  Years of Experience         Salary
count         0.0            30.000000      29.000000
mean          NaN             5.313333   75818.172414
std           NaN             2.837888   27880.649700
min           NaN             1.100000   37731.000000
25%           NaN             3.200000   56642.000000
50%           NaN             4.700000   64445.000000
75%           NaN             7.700000  101302.000000
max           NaN            10.500000  122391.000000

In [7]:
df.columns

Index(['Unnamed: 0', 'Years of Experience', 'Salary'], dtype='object')

In [8]:
df.dtypes

Unnamed: 0             float64
Years of Experience    float64
Salary                 float64
dtype: object

In [9]:
df.isnull()

    Unnamed: 0  Years of Experience  Salary
0         True                False   False
1         True                False   False
2         True                False   False
3         True                False   False
4         True                False   False
5         True                False   False
6         True                False   False
7         True                False   False
8         True                False   False
9         True                False   False
10        True                False   False
11        True                False   False
12        True                False   False
13        True                False   False
14        True                False   False
15        True                False   False
16        True                False   False
17        True                False   False
18        True                False    True
19        True                False   False
20        True                False   False
21        True                False   False
22        True                False   False
23        True                False   False
24        True                False   False
25        True                False   False
26        True                False   False
27        True                False   False
28        True                False   False
29        True                False   False

In [12]:
df.isnull().sum()

Unnamed: 0             30
Years of Experience     0
Salary                  1
dtype: int64

In [14]:
df.shape

(30, 3)

In [ ]:
df = df.drop(columns = ["Salary"])

In [3]:
import pandas as pd
df = pd.read_csv("../datasets/Book1.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           0 non-null      float64
 1   Years of Experience  30 non-null     float64
 2   Salary               29 non-null     float64
dtypes: float64(3)
memory usage: 852.0 bytes

In [12]:
names = ["Ram","Utsav","Prabin","Siddartha","a","b","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a"]
df["Name"] = names
df.head()

   Unnamed: 0  Years of Experience   Salary       Name
0         NaN                  1.1  39343.0        Ram
1         NaN                  1.3  46205.0      Utsav
2         NaN                  1.5  37731.0     Prabin
3         NaN                  2.0  43525.0  Siddartha
4         NaN                  2.2  39891.0          a

In [13]:
#.loc

In [18]:
t = df["Salary"].sum()
print(t)

2198727.0

In [ ]:
#pivot